/*
 합승 택시 요금
 
 문제 설명
 [본 문제는 정확성과 효율성 테스트 각각 점수가 있는 문제입니다.]

 밤늦게 귀가할 때 안전을 위해 항상 택시를 이용하던 무지는 최근 야근이 잦아져 택시를 더 많이 이용하게 되어 택시비를 아낄 수 있는 방법을 고민하고 있습니다. "무지"는 자신이 택시를 이용할 때 동료인 어피치 역시 자신과 비슷한 방향으로 가는 택시를 종종 이용하는 것을 알게 되었습니다. "무지"는 "어피치"와 귀가 방향이 비슷하여 택시 합승을 적절히 이용하면 택시요금을 얼마나 아낄 수 있을 지 계산해 보고 "어피치"에게 합승을 제안해 보려고 합니다.

 위 예시 그림은 택시가 이동 가능한 반경에 있는 6개 지점 사이의 이동 가능한 택시노선과 예상요금을 보여주고 있습니다.
 그림에서 A와 B 두 사람은 출발지점인 4번 지점에서 출발해서 택시를 타고 귀가하려고 합니다. A의 집은 6번 지점에 있으며 B의 집은 2번 지점에 있고 두 사람이 모두 귀가하는 데 소요되는 예상 최저 택시요금이 얼마인 지 계산하려고 합니다.

 그림의 원은 지점을 나타내며 원 안의 숫자는 지점 번호를 나타냅니다.
 지점이 n개일 때, 지점 번호는 1부터 n까지 사용됩니다.
 지점 간에 택시가 이동할 수 있는 경로를 간선이라 하며, 간선에 표시된 숫자는 두 지점 사이의 예상 택시요금을 나타냅니다.
 간선은 편의 상 직선으로 표시되어 있습니다.
 위 그림 예시에서, 4번 지점에서 1번 지점으로(4→1) 가거나, 1번 지점에서 4번 지점으로(1→4) 갈 때 예상 택시요금은 10원으로 동일하며 이동 방향에 따라 달라지지 않습니다.
 예상되는 최저 택시요금은 다음과 같이 계산됩니다.
 4→1→5 : A, B가 합승하여 택시를 이용합니다. 예상 택시요금은 10 + 24 = 34원 입니다.
 5→6 : A가 혼자 택시를 이용합니다. 예상 택시요금은 2원 입니다.
 5→3→2 : B가 혼자 택시를 이용합니다. 예상 택시요금은 24 + 22 = 46원 입니다.
 A, B 모두 귀가 완료까지 예상되는 최저 택시요금은 34 + 2 + 46 = 82원 입니다.
 [문제]
 지점의 개수 n, 출발지점을 나타내는 s, A의 도착지점을 나타내는 a, B의 도착지점을 나타내는 b, 지점 사이의 예상 택시요금을 나타내는 fares가 매개변수로 주어집니다. 이때, A, B 두 사람이 s에서 출발해서 각각의 도착 지점까지 택시를 타고 간다고 가정할 때, 최저 예상 택시요금을 계산해서 return 하도록 solution 함수를 완성해 주세요.
 만약, 아예 합승을 하지 않고 각자 이동하는 경우의 예상 택시요금이 더 낮다면, 합승을 하지 않아도 됩니다.

 [제한사항]
 지점갯수 n은 3 이상 200 이하인 자연수입니다.
 지점 s, a, b는 1 이상 n 이하인 자연수이며, 각기 서로 다른 값입니다.
 즉, 출발지점, A의 도착지점, B의 도착지점은 서로 겹치지 않습니다.
 fares는 2차원 정수 배열입니다.
 fares 배열의 크기는 2 이상 n x (n-1) / 2 이하입니다.
 예를들어, n = 6이라면 fares 배열의 크기는 2 이상 15 이하입니다. (6 x 5 / 2 = 15)
 fares 배열의 각 행은 [c, d, f] 형태입니다.
 c지점과 d지점 사이의 예상 택시요금이 f원이라는 뜻입니다.
 지점 c, d는 1 이상 n 이하인 자연수이며, 각기 서로 다른 값입니다.
 요금 f는 1 이상 100,000 이하인 자연수입니다.
 fares 배열에 두 지점 간 예상 택시요금은 1개만 주어집니다. 즉, [c, d, f]가 있다면 [d, c, f]는 주어지지 않습니다.
 출발지점 s에서 도착지점 a와 b로 가는 경로가 존재하는 경우만 입력으로 주어집니다.
 [입출력 예]
 n    s    a    b    fares    result
 6    4    6    2    [[4, 1, 10], [3, 5, 24], [5, 6, 2], [3, 1, 41], [5, 1, 24], [4, 6, 50], [2, 4, 66], [2, 3, 22], [1, 6, 25]]    82
 7    3    4    1    [[5, 7, 9], [4, 6, 4], [3, 6, 1], [3, 2, 3], [2, 1, 6]]    14
 6    4    5    6    [[2,6,6], [6,3,7], [4,6,7], [6,5,11], [2,5,12], [5,3,20], [2,4,8], [4,3,9]]    18
 입출력 예에 대한 설명
 입출력 예 #1
 문제 예시와 같습니다.

 입출력 예 #2
 2021_kakao_taxi_02.png

 합승을 하지 않고, B는 3→2→1, A는 3→6→4 경로로 각자 택시를 타고 가는 것이 최저 예상 택시요금입니다.
 따라서 최저 예상 택시요금은 (3 + 6) + (1 + 4) = 14원 입니다.
 입출력 예 #3
 2021_kakao_taxi_03.png

 A와 B가 4→6 구간을 합승하고 B가 6번 지점에서 내린 후, A가6→5` 구간을 혼자 타고 가는 것이 최저 예상 택시요금입니다.
 따라서 최저 예상 택시요금은 7 + 11 = 18원 입니다.
 */

import Foundation

class Node<T> {
    let value: T
    var nextNode: Node<T>?
    
    init(value: T) {
        self.value = value
    }
}

struct Queue<T> {
    var head: Node<T>?
    var tail: Node<T>?
    var count: Int = 0
    
    var isEmpty: Bool {
        head == nil
    }
    
    mutating func enqueue(value: T) {
        let node = Node(value: value)
        
        if isEmpty {
            head = node
            tail = node
        }
        else {
            tail?.nextNode = node
            tail = node
        }
        
        count += 1
    }
    
    mutating func dequeue() -> T? {
        guard let popNode = head
        else { return nil }
        
        head = popNode.nextNode
        
        count -= 1
        
        return popNode.value
    }
}

// n: 지점의 갯수 s: 출발지점 a의 도착지점 b의 도착지점
// 어떤 지점으로부터 각기 다른 지점까지의 최솟값을 구하려면 플로이드 워셜 방법이 최적임
func solution(_ n:Int, _ s:Int, _ a:Int, _ b:Int, _ fares:[[Int]]) -> Int {
    var map = [[Int]](repeating: [Int](repeating: Int.max, count: n+1), count: n+1)
    
    for fare in fares {
        map[fare[0]][fare[1]] = fare[2]
        map[fare[1]][fare[0]] = fare[2]
    }
    
    for i in 1...n {
        map[i][i] = 0
    }
    
    for k in 1...n {
        for i in 1...n {
            for j in 1...n {
                if map[i][k] != Int.max && map[k][j] != Int.max  {
                    // -1로 하지 말기 초기값은 Int.max로
                    map[i][j] = min(map[i][k] + map[k][j], map[i][j])
                }
            }
        }
    }
    
    var result = map[s][a] + map[s][b]
    
    for k in 1...n {
        if map[s][k] != Int.max && map[k][a] != Int.max && map[k][b] != Int.max {
            let value = map[s][k] + map[k][a] + map[k][b]
            result = min(result, value)
        }
    }
    
    return result
}
/*
 테스트 1 〉    통과 (0.06ms, 16.1MB)
 테스트 2 〉    통과 (0.05ms, 16.2MB)
 테스트 3 〉    통과 (0.08ms, 16.4MB)
 테스트 4 〉    통과 (0.25ms, 16.5MB)
 테스트 5 〉    통과 (0.28ms, 16.3MB)
 테스트 6 〉    통과 (0.29ms, 16.3MB)
 테스트 7 〉    통과 (0.36ms, 16.4MB)
 테스트 8 〉    통과 (0.48ms, 16.5MB)
 테스트 9 〉    통과 (0.48ms, 16.4MB)
 테스트 10 〉    통과 (0.95ms, 16.4MB)
 효율성  테스트
 테스트 1 〉    통과 (88.11ms, 16.8MB)
 테스트 2 〉    통과 (325.38ms, 17.3MB)
 테스트 3 〉    통과 (423.63ms, 16.5MB)
 테스트 4 〉    통과 (410.05ms, 16.7MB)
 테스트 5 〉    통과 (441.92ms, 16.5MB)
 테스트 6 〉    통과 (441.69ms, 16.6MB)
 테스트 7 〉    통과 (820.65ms, 23MB)
 테스트 8 〉    통과 (839.84ms, 22.7MB)
 테스트 9 〉    통과 (826.03ms, 22.9MB)
 테스트 10 〉    통과 (822.60ms, 22.9MB)
 테스트 11 〉    통과 (839.17ms, 22.6MB)
 테스트 12 〉    통과 (817.16ms, 19.4MB)
 테스트 13 〉    통과 (816.93ms, 19.6MB)
 테스트 14 〉    통과 (829.89ms, 19.8MB)
 테스트 15 〉    통과 (834.16ms, 19.5MB)
 테스트 16 〉    통과 (370.00ms, 16.5MB)
 테스트 17 〉    통과 (386.10ms, 16.6MB)
 테스트 18 〉    통과 (371.86ms, 16.4MB)
 테스트 19 〉    통과 (702.97ms, 17MB)
 테스트 20 〉    통과 (747.52ms, 17.3MB)
 테스트 21 〉    통과 (777.67ms, 17.3MB)
 테스트 22 〉    통과 (898.75ms, 19.7MB)
 테스트 23 〉    통과 (816.87ms, 19.7MB)
 테스트 24 〉    통과 (817.55ms, 19.8MB)
 테스트 25 〉    통과 (285.84ms, 16.4MB)
 테스트 26 〉    통과 (248.98ms, 16.6MB)
 테스트 27 〉    통과 (756.56ms, 17.3MB)
 테스트 28 〉    통과 (746.91ms, 17.3MB)
 테스트 29 〉    통과 (69.28ms, 16.5MB)
 테스트 30 〉    통과 (67.72ms, 16.3MB)
 */

solution(6, 4, 6, 2, [[4, 1, 10], [3, 5, 24], [5, 6, 2], [3, 1, 41], [5, 1, 24], [4, 6, 50], [2, 4, 66], [2, 3, 22], [1, 6, 25]]) // 82

solution(7, 3, 4, 1, [[5, 7, 9], [4, 6, 4], [3, 6, 1], [3, 2, 3], [2, 1, 6]]) // 14

solution(6,4, 5, 6, [[2,6,6], [6,3,7], [4,6,7], [6,5,11], [2,5,12], [5,3,20], [2,4,8], [4,3,9]]) // 18
